app/controllers/books_controller.rb

SELECT  "books".* FROM "books"  ORDER BY "books"."title" ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "books"
---
  def index
    @available_at = Time.now
    @books = Book.order(:title).page(params[:page])

INSERT INTO "books" ("title", "isbn", "genre", "abstract", "image_cover_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["isbn", ""], ["genre", ""], ["abstract", ""], ["image_cover_url", ""], ["created_at", "2015-04-30 03:04:17.699030"], ["updated_at", "2015-04-30 03:04:17.699030"]]
---
  def create
    @book = Book.new(book_params)
    if @book.save

UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "b"], ["updated_at", "2015-04-30 02:51:56.569518"], ["id", 9]]
---
  def update
    if @book.update(book_params)